app/views/users/index.html.erb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` IN (SELECT `relationships`.`id` FROM `relationships` WHERE `relationships`.`user_id` = 2)
SELECT COUNT(*) FROM `tweets` WHERE `tweets`.`user_id` = '2'
---
          <li class="list-inline-item">Tweet</li>
            <span class="badge badge-primary badge-pill"><%= @user["Tweet"].count %></span>