app/controllers/relationships_controller.rb

  def create
    user = User.find(params[:follow_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]

  def destroy
    user = User.find(params[:follow_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]

  def set_user
    user = User.find(params[:follow_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1