app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    if @tweet.save
---
INSERT INTO `tweets` (`comment`, `created_at`, `updated_at`, `user_id`, `name`) VALUES ('Test', '2019-05-07 23:58:39', '2019-05-07 23:58:39', '2', 'bbb')