app/controllers/users_controller.rb

SELECT `relationships`.`follow_id` FROM `relationships` WHERE `relationships`.`user_id` = 2
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` IN (SELECT `relationships`.`id` FROM `relationships` WHERE `relationships`.`user_id` = 2)
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 20
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    @tweet = Tweet.new
    # フォロー中のユーザを取得
    follower = Relationship.where(user_id: current_user.id).pluck(:follow_id)
    # 現在のユーザーとフォロー中のユーザの投稿を取得
    @tweets = Tweet.where(user_id: current_user.id).or(Tweet.where(user_id: follower))
    # サイドバーで使用する現在のユーザーの情報を取得
    @user = { "name" => current_user.name , "Tweet" =>  Tweet.where(user_id: current_user.id), "Follow" => Relationship.where(user_id: current_user.id).pluck(:follow_id), "Follower" => Relationship.where(follow_id: current_user.id)}
    # サイドバーで使用する現在のユーザー以外の情報を取得
    @other_user = User.where.not(id: current_user.id)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = '2'
---
  def show
    @user = User.find(params[:id])
    @show_tweets = Tweet.where(user_id: @user.id)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def following
    @user  = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def followers
    @user  = User.find(params[:id])